spec/cassettes/Create_payment_on_successul_charge/creates_a_payment_associated_with_the_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_103tVW20rukLV0WoS6Pv3sxt
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_0FpmDmQi1YnBQuNKiWUH4Qm5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.11.0\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-linux\",\"publisher\":\"stripe\",\"uname\":\"Linux
        zac-mint 3.11.0-12-generic #19-Ubuntu SMP Wed Oct 9 16:20:46 UTC 2013 x86_64
        x86_64 x86_64 GNU/Linux\"}"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 21 Apr 2014 15:22:20 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1460'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_103tVW20rukLV0WoS6Pv3sxt",
          "created": 1398090873,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_103tVW20rukLV0Woy8rZdBdn",
              "object": "charge",
              "created": 1398090872,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_103tVW20rukLV0Woo85LL0ps",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 9,
                "exp_year": 2017,
                "fingerprint": "YDswDJ57KdtFpKMt",
                "customer": "cus_3tVWkvqzmpjSDY",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              },
              "captured": true,
              "refunds": [],
              "balance_transaction": "txn_103tVW20rukLV0WoHTul4XfT",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_3tVWkvqzmpjSDY",
              "invoice": "in_103tVW20rukLV0WozN3MwSuW",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": "MyFlix"
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_3tVW0r8ICf4VFq"
        }
    http_version: 
  recorded_at: Mon, 21 Apr 2014 15:22:20 GMT
recorded_with: VCR 2.9.0
